References/ASTT/TestSuits/Tests/DeviceDiscovery/TC.DD.NVT.01/TC.DD.NVT.01_REQ_02.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:d="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:wsadis="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:dn="http://www.onvif.org/ver10/network/wsdl">
  <soap:Header>
    <wsadis:MessageID>uuid:bbd68ac4-7b89-47a1-a989-5fd218764173</wsadis:MessageID>
    <wsadis:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsadis:To>
    <wsadis:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Probe</wsadis:Action>
  </soap:Header>
  <soap:Body>
    <d:Probe>
      <d:Types>dn:NetworkVideoTransmitter</d:Types>
      <d:Scopes MatchBy="BADTYPE" />
    </d:Probe>
  </soap:Body>
</soap:Envelope>